# language: ru

  Функционал: Демо-версия Сбербанк онлайн

    Сценарий: Ошибка авторизации без пароля и логина

      Когда перешли на начальную страницу Сбербанк демо
      Тогда скрыли подсказки

      Когда нажали на кнопку "Войти"
      Тогда появилась ошибка "Введите идентификатор или логин пользователя (автотест с FAIL)"

    Сценарий: Авторизация по паролю, логину и СМС

      Когда перешли на начальную страницу Сбербанк демо
      Тогда скрыли подсказки

      Когда заполнили поля в окне "Вход":
        |Логин|test|
        |Пароль|password|
      И нажали на кнопку "Войти"
      Тогда появилось окно "Подтверждение входа"

      Когда заполнили поля в окне "Подтверждение входа":
        |СМС-пароль|12345|
      И нажали на кнопку "Подтвердить"
      Тогда появилось окно "Какому действию Вы хотите научиться?"