# language: ru

  Функционал: Поиск в Яндексе

    Сценарий: Открытие Сбербанк онлайн через поиск в Яндексе

      Когда перешли на страницу поиска Яндекса
      Тогда отобразилась форма поиска

      Когда заполнили поля в окне "Яндекс":
        |Поиск|Сбербанк онлайн|
      И нажали на кнопку "Найти"
      Тогда отобразился список результатов с записью:
        |Заголовок|Сбербанк Онлайн|
        |Ссылка|online.sberbank.ru|

      Когда нажали по ссылке "online.sberbank.ru" с заголовком "Сбербанк Онлайн" из результата поиска
      И переключились на новую вкладку
      Тогда отобразилась форма авторизации в Сбербанк онлайн
